main.floors.MT1=
{
    "floorId": "MT1",
    "title": "寂静之森外围",
    "name": "寂静之森外围",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "map007_bg.png",
            "x": 0,
            "y": 0,
            "canvas": "bg"
        }
    ],
    "ratio": 1,
    "defaultGround": "ground",
    "firstArrive": [
        {
            "type": "playSound",
            "name": "forest.mp3"
        },
        {
            "type": "setText",
            "align": "center"
        },
        "\t[贾斯汀]啊……",
        "\t[贾斯汀]头好痛……",
        "\t[贾斯汀]我刚刚是透支体力昏过去了么。队长呢？其他人呢？",
        "\t[贾斯汀]等等，我想起来了……",
        "\t[贾斯汀]队长，队长他一个人把那些魔兽引开了，然后让我们拼命逃……",
        "\t[贾斯汀]…………",
        "\t[贾斯汀]希望我之前跑的方向没有错，这里应该是离开森林的道路。",
        "\t[贾斯汀]说不定其他人已经回去了呢，哈哈……",
        "\t[贾斯汀]伟大的全能之神，请您保佑我和我队友们吧……",
        "\t[贾斯汀]啊，这本书要收好，或许可以避免在森林里遇上一些危险。",
        {
            "type": "setText",
            "align": "left"
        },
        {
            "type": "tip",
            "text": "【寂静之森外围 (15×15)】方向键移动，探索迷宫，击败魔兽！"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "3,1": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "playSound",
                    "name": "item.mp3"
                },
                {
                    "type": "setText",
                    "align": "center"
                },
                "\t[宝箱]打开了宝箱！",
                "\t[系统]获得了【佣兵短剑】！攻击力 +10！",
                {
                    "type": "setText",
                    "align": "left"
                },
                {
                    "type": "setValue",
                    "name": "status:atk",
                    "operator": "+=",
                    "value": "10"
                },
                {
                    "type": "hide",
                    "remove": true
                }
            ]
        },
        "4,1": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "setText",
                    "align": "center"
                },
                "\t[路牌]设定说明之一键换装。",
                "\t[路牌]接下来你可能要经常改变自己的装备，用以应对不",
                "\t[路牌]同特性的敌人。",
                "\t[路牌]事实上，你可以选择使用一键换装的功能来快速切",
                "\t[路牌]换身上的装备。在装备栏界面默认按W+数字键，可",
                "\t[路牌]以将当前装备组合保存起来，为第“你所按的数字",
                "\t[路牌]键”号套装。",
                "\t[路牌]之后在游戏界面，你可以再次按W+数字键，来一键",
                "\t[路牌]切换到你所保存过的套装形态。",
                "\t[路牌]同时你也可以按A键查看当前所有的套装组合。",
                "\t[路牌]当然，若是你不想使用系统默认的快捷键，那么你",
                "\t[路牌]可以在菜单界面的系统设置里，对按键进行设置。",
                "\t[路牌]另外还有一点需要注意的是。",
                "\t[路牌]同种装备，可以同时装备多个，比如同时装备着两",
                "\t[路牌]把剑……",
                "\t[路牌]重要的事情说三遍！",
                "\t[路牌]同种装备，可以同时装备多个，比如同时装备着两",
                "\t[路牌]把剑！",
                "\t[路牌]重要的事情说三遍！",
                "\t[路牌]同种装备，可以同时装备多个，比如同时装备着两",
                "\t[路牌]把剑！",
                {
                    "type": "setText",
                    "align": "left"
                }
            ]
        },
        "7,8": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "setText",
                    "align": "center"
                },
                "\t[路牌]设定说明之攻速",
                "\t[路牌]攻速可以理解为一个DPS即伤害输出的参数",
                "\t[路牌]系数为攻速的平方根/10",
                "\t[路牌]例如攻击力为15，攻速400%，对手防御为5",
                "\t[路牌]那么每回合实际造成伤害为（15-5）*2.0",
                "\t[路牌]2.0即是由攻速得来的系数",
                "\t[路牌]该计算方法对于低于100%的攻速同样起效",
                {
                    "type": "setText",
                    "align": "left"
                }
            ]
        },
        "0,12": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "setText",
                    "align": "center"
                },
                "\t[路牌]设定说明之查看技能",
                "\t[路牌]按X或ESC打开菜单后，可以看到怪物列表，在列表",
                "\t[路牌]中选中一个怪物按确定键即可查看怪物技能的详细",
                "\t[路牌]信息。",
                "\t[路牌]对于同种技能，不同种类怪物的具体数值效果往往",
                "\t[路牌]也不同，请注意这一点，即时确认每个怪物的技能",
                "\t[路牌]及技能效果。",
                {
                    "type": "setText",
                    "align": "left"
                }
            ]
        },
        "2,14": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "setText",
                    "align": "center"
                },
                "\t[贾斯汀]那里太危险了……队长让我们往外围逃，不能回头。",
                {
                    "type": "setText",
                    "align": "left"
                }
            ]
        }
    },
    "changeFloor": {
        "12,0": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
        [
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            87,
            17,
            17
        ],
        [
            17,
            31,
            210,
            38,
            129,
            17,
            0,
            31,
            0,
            32,
            17,
            17,
            0,
            31,
            17
        ],
        [
            17,
            206,
            17,
            17,
            17,
            17,
            0,
            17,
            17,
            202,
            17,
            17,
            17,
            0,
            17
        ],
        [
            17,
            0,
            0,
            202,
            31,
            17,
            201,
            17,
            31,
            0,
            17,
            17,
            17,
            205,
            17
        ],
        [
            17,
            21,
            17,
            17,
            31,
            203,
            0,
            205,
            0,
            0,
            0,
            203,
            0,
            0,
            17
        ],
        [
            17,
            0,
            17,
            17,
            17,
            0,
            17,
            17,
            17,
            201,
            17,
            17,
            17,
            0,
            17
        ],
        [
            17,
            203,
            17,
            27,
            202,
            0,
            17,
            17,
            31,
            205,
            28,
            17,
            17,
            0,
            17
        ],
        [
            17,
            0,
            17,
            17,
            17,
            81,
            17,
            17,
            17,
            27,
            203,
            0,
            17,
            201,
            17
        ],
        [
            17,
            0,
            201,
            0,
            0,
            201,
            0,
            129,
            17,
            17,
            81,
            0,
            31,
            0,
            17
        ],
        [
            17,
            17,
            0,
            17,
            17,
            17,
            0,
            31,
            17,
            0,
            0,
            17,
            17,
            17,
            17
        ],
        [
            17,
            17,
            0,
            17,
            17,
            17,
            0,
            0,
            201,
            0,
            17,
            17,
            27,
            17,
            17
        ],
        [
            17,
            31,
            0,
            21,
            17,
            17,
            0,
            17,
            17,
            81,
            17,
            0,
            209,
            32,
            17
        ],
        [
            129,
            0,
            0,
            0,
            0,
            0,
            205,
            17,
            33,
            206,
            0,
            31,
            17,
            17,
            17
        ],
        [
            17,
            33,
            0,
            28,
            17,
            17,
            28,
            17,
            17,
            0,
            0,
            17,
            17,
            17,
            17
        ],
        [
            17,
            17,
            0,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17
        ]
    ],
    "bgmap": [],
    "fgmap": [],
    "downFloor": [
        2,
        12
    ],
    "upFloor": [
        12,
        0
    ],
    "bgm": "forest.mp3",
    "beforeBattle": {},
    "cannotMoveIn": {},
    "autoEvent": {},
    "canFlyFrom": true
}
