main.floors.MT11 =
{
    "floorId": "MT11",
    "title": "厄泽城·法芙娜寓所",
    "name": "法芙娜寓所",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "defaultGround": "ground",
    "images": [
        {
            "name": "map058_bg.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "upFloor": [
        8,
        11
    ],
    "downFloor": [
        8,
        11
    ],
    "firstArrive": [
        {
            "type": "tip",
            "text": "进入【厄泽城·法芙娜寓所】"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,12": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "playSound",
                    "name": "door.mp3"
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT10",
                    "loc": [
                        16,
                        7
                    ],
                    "direction": "down"
                }
            ]
        },
        "7,6": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "if",
                    "condition": "core.hasFlag('ch1_ended')",
                    "true": [
                        "\t[法芙娜]倒在血泊中的法芙娜已经失去了呼吸，一切都无法挽回了……"
                    ],
                    "false": [
                        {
                            "type": "playSound",
                            "name": "cursor.mp3"
                        },
                        "\t[贾斯汀,hero]\b[up,hero]…………",
                        "\t[法芙娜,woman]\b[up,7,6]…………",
                        "\t[贾斯汀,hero]\b[up,hero]为什么要这么做。",
                        "\t[法芙娜,woman]\b[up,7,6]他们说你死了。死在了遗迹里。",
                        "\t[贾斯汀,hero]\b[up,hero]那又如何。",
                        "\t[法芙娜,woman]\b[up,7,6]我，我总得为未来……做出点什么。",
                        "\t[贾斯汀,hero]\b[up,hero]那为什么偏偏是他！",
                        "\t[法芙娜,woman]\b[up,7,6]……他有钱。他有很多很多钱。有他在，城里没有人敢欺负我。",
                        "\t[贾斯汀,hero]\b[up,hero]…………法芙娜，告诉我，告诉我你不是自愿的！",
                        "\t[贾斯汀,hero]\b[up,hero]快告诉我你是被他逼迫的！！",
                        "\t[法芙娜,woman]\b[up,7,6]…………是又怎么样？！",
                        "\t[法芙娜,woman]\b[up,7,6]实话告诉你，早在半年之前，我们就已经好上了！这次也不过是把你支出去了而已！",
                        "\t[贾斯汀,hero]\b[up,hero]不，为什么……",
                        "\t[法芙娜,woman]\b[up,7,6]我一个女孩子，想在这世上生存容易吗！不过是出卖一下自己的身体，那又怎么样？！",
                        "\t[法芙娜,woman]\b[up,7,6]看清楚你自己吧！你只是个穷小子，一穷二白的穷小子！你难道想让我陪你一辈子吃糠咽菜吗？！",
                        "\t[贾斯汀,hero]\b[up,hero]不，法芙娜，不要再说了……",
                        "\t[法芙娜,woman]\b[up,7,6]我梦想中要的大房子，奢侈的生活，就凭你能够带给我吗？",
                        "\t[法芙娜,woman]\b[up,7,6]格瑞迪他则不同，他是贵族，他的家里有王牌佣兵级别的供奉，他更是当今厄泽城第一强者佣兵公会会长马格罗斯的亲外甥！",
                        "\t[法芙娜,woman]\b[up,7,6]那可是一位尊贵无比的职业者，职业者啊！这些，你能比吗？！",
                        "\t[贾斯汀,hero]\b[up,hero]…………",
                        "\t[贾斯汀,hero]\b[up,hero]……他没办法再带给你这些了。",
                        "\t[法芙娜,woman]\b[up,7,6]什么意思？",
                        "\t[贾斯汀,hero]\b[up,hero]……我杀了他。",
                        "\t[法芙娜,woman]\b[up,7,6]啊？！你，你竟然……你竟然杀了他！",
                        "\t[贾斯汀,hero]\b[up,hero]听我说，法芙娜，你想要的金币，和舒适的生活，我都能给你！我现在已经是一名辉煌佣兵了，就算是职业者我也不是没有对抗的能力，这些东西很快就会有的，相信我……",
                        "\t[法芙娜,woman]\b[up,7,6]你在做什么白日梦！天呐，你竟然杀了格瑞迪！我要去告诉会长！！",
                        "\t[贾斯汀,hero]\b[up,hero]不！不要……！",
                        {
                            "type": "playSound",
                            "name": "attack.mp3"
                        },
                        "\t[法芙娜,woman]\b[up,7,6]…………诶？",
                        "\t[贾斯汀,hero]\b[up,hero]……………………",
                        {
                            "type": "tip",
                            "text": "失控的剑锋穿透了法芙娜的胸膛。曾经海誓山盟的恋人，倒在了血泊中。"
                        },
                        {
                            "type": "setFlag",
                            "name": "ch1_ended",
                            "value": true
                        },
                        "\t[系统提示]第一章【寂静之森与厄泽城】主线剧情全部达成！\n\n贾斯汀在公会与全城的通缉追杀下，连夜逃离厄泽城，登上开往【普利斯特王都】的远洋商船……"
                    ]
                }
            ]
        }
    },
    "changeFloor": {
        "8,12": {
            "floorId": "MT10",
            "loc": [
                16,
                7
            ],
            "direction": "down"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            17,
            17,
            17,
            17,
            17,
            17,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            17,
            17,
            17,
            17,
            17,
            17,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            17,
            17,
            0,
            17,
            17,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            17,
            17,
            17,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            17,
            17,
            0,
            0,
            0,
            17,
            17,
            17,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            17,
            17,
            17,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            17,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ]
    ]
}