main.floors.MT9 =
{
    "floorId": "MT9",
    "title": "厄泽城·瑞格沃酒馆",
    "name": "瑞格沃酒馆",
    "width": 21,
    "height": 16,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "bgm": "厄泽城.mp3",
    "cannotViewMap": false,
    "defaultGround": "ground",
    "images": [
        {
            "name": "map020_bg.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "upFloor": [
        5,
        14
    ],
    "downFloor": [
        5,
        14
    ],
    "firstArrive": [
        {
            "type": "tip",
            "text": "进入【厄泽城·瑞格沃酒馆】"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,15": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "playSound",
                    "name": "door.mp3"
                },
                {
                    "type": "changeFloor",
                    "floorId": "MT6",
                    "loc": [
                        58,
                        68
                    ],
                    "direction": "down"
                }
            ]
        },
        "7,7": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "playSound",
                    "name": "cursor.mp3"
                },
                "\t[老板娘,woman]\b[up,7,7]哎呀小哥，看你风尘仆仆的，快坐下歇歇脚！",
                "\t[老板娘,woman]\b[up,7,7]瑞格沃酒馆有全城最地道的麦酒和烤肉，喝上一杯，疲劳一扫而空！",
                {
                    "type": "choices",
                    "text": "\t[老板娘,woman]要来一杯招牌麦酒（恢复全部生命与体力）吗？",
                    "choices": [
                        {
                            "text": "来一杯！(免费犒劳年轻佣兵)",
                            "action": [
                                {
                                    "type": "playSound",
                                    "name": "recovery.mp3"
                                },
                                {
                                    "type": "setValue",
                                    "name": "status:hp",
                                    "operator": "=",
                                    "value": "status:maxHp"
                                },
                                {
                                    "type": "tip",
                                    "text": "生命值已完全恢复！"
                                },
                                "\t[老板娘,woman]\b[up,7,7]精神好多了吧！在外面闯荡可别太拼命，公会那群老狐狸可不会心疼你！"
                            ]
                        },
                        {
                            "text": "暂时不用，谢谢老板娘",
                            "action": [
                                "\t[老板娘,woman]\b[up,7,7]好嘞，有需要随时叫我！"
                            ]
                        }
                    ]
                }
            ]
        },
        "11,11": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "playSound",
                    "name": "cursor.mp3"
                },
                "\t[重甲佣兵,man]\b[up,11,11]妈的，公会那帮人真是让人火大！",
                "\t[重甲佣兵,man]\b[up,11,11]居然说只允许特级佣兵通过封锁线，还把老子给踹了回来！",
                "\t[重甲佣兵,man]\b[up,11,11]奶奶的，不就是特级佣兵吗，老子只需要顶多几个月就能晋升了，至于在乎那么一会儿？！"
            ]
        },
        "13,6": {
            "trigger": "action",
            "enable": true,
            "data": [
                {
                    "type": "playSound",
                    "name": "cursor.mp3"
                },
                "\t[红发佣兵,man]\b[up,13,6]ZZZZ……呼噜噜……",
                "\t[贾斯汀,hero]\b[up,hero]好像已经彻底睡着了，而原本坐在他对面的人并没有买单的样子。"
            ]
        },
        "3,8": {
            "trigger": "action",
            "enable": true,
            "data": [
                "\t[贾斯汀,hero]\b[up,hero]那边是通往酒馆二楼客房的走廊，目前不需要住宿。"
            ]
        }
    },
    "changeFloor": {
        "5,15": {
            "floorId": "MT6",
            "loc": [
                58,
                68
            ],
            "direction": "down"
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "map": [
        [
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17
        ],
        [
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17
        ],
        [
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17
        ],
        [
            17,
            17,
            17,
            0,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17
        ],
        [
            17,
            17,
            17,
            0,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17
        ],
        [
            17,
            17,
            17,
            0,
            0,
            17,
            0,
            0,
            17,
            17,
            17,
            0,
            0,
            0,
            0,
            17,
            0,
            0,
            0,
            17,
            17
        ],
        [
            17,
            17,
            0,
            0,
            0,
            0,
            0,
            0,
            17,
            0,
            0,
            17,
            17,
            0,
            0,
            17,
            0,
            0,
            0,
            17,
            17
        ],
        [
            17,
            17,
            0,
            0,
            0,
            0,
            0,
            0,
            17,
            0,
            0,
            17,
            17,
            0,
            0,
            17,
            0,
            0,
            0,
            17,
            17
        ],
        [
            17,
            17,
            17,
            0,
            17,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            17
        ],
        [
            17,
            17,
            17,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            17
        ],
        [
            17,
            17,
            17,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            17
        ],
        [
            17,
            17,
            17,
            17,
            0,
            0,
            17,
            0,
            17,
            17,
            0,
            0,
            17,
            17,
            0,
            0,
            17,
            17,
            0,
            0,
            17
        ],
        [
            17,
            17,
            17,
            17,
            0,
            0,
            17,
            0,
            17,
            17,
            0,
            0,
            17,
            17,
            0,
            0,
            17,
            17,
            0,
            0,
            17
        ],
        [
            17,
            17,
            17,
            17,
            0,
            0,
            17,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            17
        ],
        [
            17,
            17,
            17,
            17,
            0,
            0,
            17,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            17
        ],
        [
            17,
            17,
            17,
            17,
            17,
            0,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17,
            17
        ]
    ],
    "cannotMoveIn": {},
    "autoEvent": {}
}
