$shuwei=["","万","亿","兆","京","垓","秭","穰","沟","涧","正","载","极","阿僧第","那由他","恒河沙","不可思议","无量","大数"]
$shuwei2=["","W","E","Z","J","G","Zi","R","Go","Jian","Zh","Za","Ji","阿僧第","那由他","恒河沙","不可思议","无量","大数"]
$shuwei3=["","K","M","G"]
$lvstr=[
    "","下级佣兵","中级佣兵","高级佣兵","特级佣兵","王牌佣兵", #5
    "荣耀佣兵","辉煌佣兵","准职业者","黑铁职业者","青铜职业者",#10
    "白银职业者","黄金职业者","蓝玉职业者","紫晶职业者","半步英雄", #15
    "英雄一阶","英雄二阶","英雄三阶","英雄四阶","英雄五阶", #20
    "英雄六阶","英雄七阶","英雄八阶","英雄九阶","半步传奇", #25
    "传奇初成","传奇大成","传奇圆满","传奇巅峰","传奇王者", #30
    "史诗初阶","史诗中阶","史诗高阶","史诗巅峰","史诗帝皇", #35
    "初始超凡","高等超凡","圣域超凡", #超凡38
    "炼星圣者","破虚圣者","入灭圣者", #圣者41
    "下位域主","中位域主","上位域主", #圣域君主44
    "初始主宰","宇光主宰","宙海主宰","巅峰主宰",#无尽主宰48
    "神火境",
    #圣域是一个大境界，分为超凡、入圣（圣者）、圣域君主（圣地之主）、无尽主宰四大层次
    "凑数","凑数","凑数","凑数","凑数","凑数","凑数","凑数","凑数","凑数","凑数","凑数","凑数"
    ]
 
$lvstr[201,15]=[
  "天枢洞天","天璇洞天","天玑洞天","天权洞天",
  "玉衡洞天","开阳洞天","瑶光洞天", #207
  "天人境初期","天人境中期","天人境后期","天人境巅峰",
  "入道境初期","入道境中期","入道境后期","入道境巅峰", #215
  "太易仙台","太初仙台","太始仙台","太素仙台","太极仙台","不坠之境", #221
  "命缺","命宫","命轮","命海","命空", #226
  "奇点宙光","开弦宙光","闭弦宙光","虚粒宙光","律境宙光" #231
]
    
$lvstr[301,43]=[
  "一级初期","一级中期","一级后期","一级巅峰", #304
  "二级初期","二级中期","二级后期","二级巅峰", #308
  "三级初期","三级中期","三级后期","三级巅峰", #312
  "四级初期","四级中期","四级后期","四级巅峰", #316
  "五级初期","五级中期","五级后期","五级巅峰", #320
  "六级初期","六级中期","六级后期","六级巅峰", #324
  "七级初期","七级中期","七级后期","七级巅峰", #328
  "八级初期","八级中期","八级后期","八级巅峰", #332 
  "九级初期","九级中期","九级后期","九级巅峰", #336
  "一阶位面之主","二阶位面之主","三阶位面之主","四阶位面之主",
  "五阶位面之主","六阶位面之主","七阶位面之主" #343
  ]

$lvstr2=[]
$lvstr2[26,10]=[
  "魂海境一重","魂海境二重","魂海境三重","","",
  "魂海境四重","魂海境五重","魂海境六重","魂海境七重",""
]
#凡骨境→灵纹境→符脉境→神轮境→登仙七步→天人境→入道境→仙台境(虚仙）
#→超脱境（真仙，仙王）→宙光境（仙尊）→造物境（仙祖，道尊）

$LvColor=[
    0,
    0,0,0,0,3, #5
    3,3,3,1,1, #10
    1,1,13,13,13, #15
    13,13,13,13,13, #20
    15,15,15,15,15, #25
    14,14,14,14,14, #30
    14,14,14,14,14, #35
    16,16,16,16,12, #40
    12,12,12,12,9 #45
    ]
    
$LvColor[201,15]=[
    14,14,14,14,14,14,14, #207
    16,16,16,16,16,16,16,16, #215
    12,12,12,12,12,9, #221
    9,9,9,9,9, #226
    18,18,18,18,18 #226
    ]
    
    
$LvColor[301,43]=[
    0,0,0,0,3,3,3,3,
    1,1,1,1,1,1,13,13,
    13,13,13,13,13,13,13,13,
    13,13,15,15,15,15,15,15,15,15,15,15,
    14,14,14,14,14,14,14 #5

    ]
$tpname=[
    "厄泽城","寂静之森深处","莱尼克之墓入口","寂静之森核心","姆伊森运河","普利斯特王都",#5
    "莱尼克之墓中层","雷霆高原","苍白之巢"
    ]
#升级所需经验
$expmax=[
        0,120,250,400,800,3500,8000,20000,0,25000,40000,65000,100000,
        210000,200000,340000,530000,800000,1030000,1600000,2000000,2500000,3000000,
        4510000,30000000,20000000,18000000,20000000,50000000,0,50000000,100000000
]

$expmax[301,43]=[
        1,1,1,1,1,1,1,1,7500,8000,15000,24000,25000,25000,30000,30000,
        40000,50000,60000,75000,100000,160000,180000,240000,250000,
        300000,350000,400000,400000,400000,400000,800000,500000,1450000,2000000,
        1146440000,30000000
]

$expmax2=[]
$expmax2[26,10]=[
        12000000,10000,10000,0,0,
        10000,10000,10000,10000,0
]
