#==============================================================================
# 本脚本来自www.66RPG.com，使用和转载请保留此信息
#============================================================================== 


# ————————————————————————————————————
# 本脚本来自www.66rpg.com，转载请保留此信息
# ————————————————————————————————————

#==============================================================================
# ■ Game_Player
#==============================================================================
class Game_Player
  #--------------------------------------------------------------------------
  # ● フレーム更新
  #--------------------------------------------------------------------------
  alias old_update update
  def update
    unless moving? or $game_system.map_interpreter.running? or
      @move_route_forcing or $game_temp.message_window_showing
      @move_speed = $game_config.data("speed")/10.0+4
      if $game_switches[171] && Input.press?(Input::SHIFT)
        @move_speed-=1.5 
        @direction_fix=true if !@direction_fix
      else
        @direction_fix=false if @direction_fix
      end
    end
    old_update
  end
end

#==============================================================================
# 本脚本来自www.66RPG.com，使用和转载请保留此信息
#============================================================================== 
