#==============================================================================
# 本脚本来自www.66RPG.com，使用和转载请保留此信息
#==============================================================================  

# Sample master list for crafting script
# written by Deke
#============================================================================================
# 简介：
# 这是一个很不错的合成物品系统，可以通过游戏的过程，不断学习可以合成的
# 物品方法。
#
# 使用方法：
# 1、召唤界面：使用脚本$scene = Scene_Craft.new
#
# 2、学习合成：$game_party.learn_recipe(合成项目)
# 
# 3、合成定义：
# 这个合成脚本可以定义两种合成物品。一种是预先定义好了的，就像下面这样,
# 直接写在这里就可以，另一种是在学习之前现场定义。
#
# 4、举例
#  4.1、学会recipe_list[1]定义的合成：$game_party.learn_recipe($game_temp.recipe_list[1])
#       注意，一行如果输入不下，在(的后面或[的后面按回车换行，否则可能出错
#
#  4.2、在游戏中临时定义一种合成，让玩家学会。使用事件中的脚本如下，   
#  脚本：
#    材料 = [$game_variables[1],$game_variables[2]]  #——材料编号是变量1、2的编号
#    材料种类 = [0,0]                                #——材料是物品
#    材料数量 = [$game_variables[3],$game_variables[4]]  #——需要材料数量是变量3、4的编号
#    成品 = $game_variables[5]                       #——获得结果编号是5
#    成品种类 = 1                                    #——成品是防具类
#    $game_party.learn_recipe(Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类))
#===========================================================================================
class Game_Temp
  attr_reader :recipe_list  
  alias crafting_temp_initialize initialize
  def initialize
    crafting_temp_initialize
    @recipe_list=[]
    get_recipe_list
  end  
  def get_recipe_list    
    ##########################################################################
    #合成：折跃匕首
    ##########################################################################
    材料 = [68,86,98]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 137                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[53] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：白银之锋
    ##########################################################################
    材料 = [125,128]             # 需要材料的数据库编号
    材料种类 = [2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1]         # 需要材料的数量
    成品 = 136                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[52] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：永恒之盘
    ##########################################################################
    材料 = [67,82,118,120,98]             # 需要材料的数据库编号
    材料种类 = [2,2,2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1,1,1]         # 需要材料的数量
    成品 = 134                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[51] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：魂之灵瓮
    ##########################################################################
    材料 = [49,82,118,110,98]             # 需要材料的数据库编号
    材料种类 = [2,2,2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1,1,1]         # 需要材料的数量
    成品 = 133                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[50] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：血棘
    ##########################################################################
    材料 = [123,63,112]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,2]         # 需要材料的数量
    成品 = 131                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[49] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：先祖韧鼓
    ##########################################################################
    材料 = [74,113]             # 需要材料的数据库编号
    材料种类 = [2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1]         # 需要材料的数量
    成品 = 130                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[48] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：影刃
    ##########################################################################
    材料 = [127,129,98]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 128                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[47] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：二阶祭品
    ##########################################################################
    材料 = [66,112]             # 需要材料的数据库编号
    材料种类 = [2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1]         # 需要材料的数量
    成品 = 126                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[46] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：天堂之戟
    ##########################################################################
    材料 = [113,87,98]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 125                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[45] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：刃甲
    ##########################################################################
    材料 = [20,24,48,111]             # 需要材料的数据库编号
    材料种类 = [2,2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1,1]         # 需要材料的数量
    成品 = 124                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[44] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：虚灵法杖C
    ##########################################################################
    材料 = [116,83,80]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 117                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[43] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：达贡之神力C
    ##########################################################################
    材料 = [76,110,98]             # 需要材料的数据库编号
    材料种类 = [2,0,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 116                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[42] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：紫怨
    ##########################################################################
    材料 = [71,89,109,98]             # 需要材料的数据库编号
    材料种类 = [2,2,0,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [2,1,1,1]         # 需要材料的数量
    成品 = 123                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[41] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：血精石
    ##########################################################################
    材料 = [121,39,49,98]             # 需要材料的数据库编号
    材料种类 = [2,2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1,1]         # 需要材料的数量
    成品 = 122                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[40] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：镇魂石
    ##########################################################################
    材料 = [118,119,120]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 121                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[39] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：散夜对剑
    ##########################################################################
    材料 = [113,114,98]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 115                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[38] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：夜叉
    ##########################################################################
    材料 = [111,47,108]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 114                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[37] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：散华
    ##########################################################################
    材料 = [110,46,107]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 113                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[36] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：洞察烟斗
    ##########################################################################
    材料 = [75,64,101]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 89                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[35] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：炎阳纹章
    ##########################################################################
    材料 = [42,88,87]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 86                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[34] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：赤红甲
    ##########################################################################
    材料 = [81,50,100]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 82                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[33] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：玄冥盾牌
    ##########################################################################
    材料 = [20,44,99]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 81                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[32] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：漩涡
    ##########################################################################
    材料 = [83,84,96]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 85                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[31] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：飓风长戟
    ##########################################################################
    材料 = [69,72,78,98]             # 需要材料的数据库编号
    材料种类 = [2,2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1,1]         # 需要材料的数量
    成品 = 79                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[30] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：原力法杖
    ##########################################################################
    材料 = [27,48,97]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 78                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[29] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：穷鬼盾
    ##########################################################################
    材料 = [10,13,7]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,3,1]         # 需要材料的数量
    成品 = 14                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[0] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：不死者大盾
    ##########################################################################
    材料 = [6,49]             # 需要材料的数据库编号
    材料种类 = [2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [3,1]         # 需要材料的数量
    成品 = 15                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[1] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：不死者大盾
    ##########################################################################
    材料 = [16,17,50]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 18                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[2] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：相位鞋
    ##########################################################################
    材料 = [4,19]             # 需要材料的数据库编号
    材料种类 = [2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,2]         # 需要材料的数量
    成品 = 21                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[3] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：静谧之鞋
    ##########################################################################
    材料 = [4,17,7]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 22                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[4] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：凝魂之露
    ##########################################################################
    材料 = [11,51]             # 需要材料的数据库编号
    材料种类 = [2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [3,1]         # 需要材料的数量
    成品 = 23                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[5] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：先锋盾
    ##########################################################################
    材料 = [14,27,28]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 29                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[6] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：水晶剑
    ##########################################################################
    材料 = [64,19,24]             # 需要材料的数据库编号
    材料种类 = [0,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 25                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[7] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：圣殿指环
    ##########################################################################
    材料 = [17,36,70]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 34                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[8] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：奥术鞋
    ##########################################################################
    材料 = [4,36,37]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 38                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[9] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：灵魂之戒
    ##########################################################################
    材料 = [27,36,67]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 39                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[10] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：重伤刺刃
    ##########################################################################
    材料 = [24,35]             # 需要材料的数据库编号
    材料种类 = [2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1]         # 需要材料的数量
    成品 = 41                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[11] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：勇气勋章
    ##########################################################################
    材料 = [20,41,68]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 42                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[12] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：影之灵龛
    ##########################################################################
    材料 = [36,46,69]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 49                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[13] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：水晶剑二阶
    ##########################################################################
    材料 = [24,25,72]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 51                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[14] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：先锋盾二阶
    ##########################################################################
    材料 = [29,46,47,73]             # 需要材料的数据库编号
    材料种类 = [2,2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1,1]         # 需要材料的数量
    成品 = 50                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[15] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：点金手
    ##########################################################################
    材料 = [8,74]             # 需要材料的数据库编号
    材料种类 = [2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1]         # 需要材料的数量
    成品 = 52                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[16] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：红杖1级
    ##########################################################################
    材料 = [24,48,77]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 53                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[17] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：抗魔斗篷
    ##########################################################################
    材料 = [23,45]             # 需要材料的数据库编号
    材料种类 = [2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1]         # 需要材料的数量
    成品 = 57                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[18] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：怨灵系带
    ##########################################################################
    材料 = [59,62]             # 需要材料的数据库编号
    材料种类 = [2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1]         # 需要材料的数量
    成品 = 60                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[19] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：天鹰之戒
    ##########################################################################
    材料 = [34,60,81]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 61                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[20] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：夜魔祭品
    ##########################################################################
    材料 = [61,40,44,27]             # 需要材料的数据库编号
    材料种类 = [2,2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,2,4,2]         # 需要材料的数量
    成品 = 66                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[21] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：卫士胫甲
    ##########################################################################
    材料 = [21,22,38]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 67                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[22] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：魔龙枪
    ##########################################################################
    材料 = [46,47,89]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,2,1]         # 需要材料的数量
    成品 = 69                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[23] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：空明杖
    ##########################################################################
    材料 = [36,48,70]             # 需要材料的数据库编号
    材料种类 = [2,2,2]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1]         # 需要材料的数量
    成品 = 71                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[24] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：魔龙枪
    ##########################################################################
    材料 = [46,71,90]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [2,1,1]         # 需要材料的数量
    成品 = 72                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[25] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：韧鼓
    ##########################################################################
    材料 = [73,36,60,91]             # 需要材料的数据库编号
    材料种类 = [2,2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1,1,1]         # 需要材料的数量
    成品 = 74                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[26] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    #########################################################################
    #合成：以太之镜
    ##########################################################################
    材料 = [37,27,92]             # 需要材料的数据库编号
    材料种类 = [2,2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,2,1]         # 需要材料的数量
    成品 = 75                 # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[27] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    ##########################################################################
    #合成：红杖2级
    ##########################################################################
    材料 = [53,93]             # 需要材料的数据库编号
    材料种类 = [2,0]         # 需要材料的种类，0是普通物品，1是防具，2是武器
    材料数量 = [1,1]         # 需要材料的数量
    成品 = 76                  # 获得物品编号
    成品种类 = 2              # 获得物品种类，0是普通物品，1是防具，2是武器
    @recipe_list[28] = Game_Recipe.new(材料,材料种类, 材料数量,成品,成品种类)
    end # of get_recipe_list method
end # of updates to Game_Temp Class

#================================
# CRAFTING PROGRAM
#----------------------------------------------------------------
#-written by Deke
#-yes_no window code created by Phsylomortis
#----------------------------------------------------------------
#================================

#updates to Game_Party class

class Game_Party
  
  attr_accessor       :recipes
  
  alias crafting_party_initialize initialize
  
  def initialize
    crafting_party_initialize
    @recipes=[]
  end
  
  #----------------------------------------------------------------------
  def know?(recipe, version = 1)
    unless recipe.is_a?(Game_Recipe)
      recipe = get_recipe_from_master_list(recipe, version)
    end
    return $game_party.recipes.include?(recipe)
  end
  
 #----------------------------------------------------------------------
  def learn_recipe(recipe , version = 1)
    unless recipe.is_a?(Game_Recipe)
      recipe = get_recipe_from_master_list(recipe, version)
    end
    if recipe.is_a?(Game_Recipe)
      unless know?(recipe)
        @recipes.push(recipe)
      end
    end
  end
  
 #----------------------------------------------------------------------
  def forget_recipe(recipe , version = 1)
    if !recipe.is_a?(Game_Recipe)
      recipe = get_recipe_from_master_list(recipe, version)
    end
    if recipe.is_a?(Game_Recipe)
      for i in 0...@recipes.size
        if recipe == @recipes[i]
          index = i
          break
        end
      end
      if index != nil
        @recipes.delete(@recipes[index])
      end
    end
  end
  
 #----------------------------------------------------------------------
  def get_recipe_from_master_list(item, version)
    index = nil
    for i in 0...$game_temp.recipe_list.size
      if item[0] == $game_temp.recipe_list[i].result and item[1] ==$game_temp.recipe_list[i].result_type
        version -= 1
        if version == 0
          index = i
          break
        end
      end
    end
    if index.is_a?(Integer)
      return ($game_temp.recipe_list[index])
    else
      return false
    end
  end
  
end # of Game_Party updates

#================================
class Game_Recipe

  attr_reader :ingredients
  attr_reader :quantities
  attr_reader :result
  attr_reader :result_type
  attr_reader :ingredient_types
  
 #----------------------------------------------------------------------
  def initialize( ingredients, ingredient_types, quantities, result, result_type)
    @ingredients = ingredients
    @ingredient_types = ingredient_types
    @quantities = quantities
    @result = result
    @result_type = result_type
  end
  
 #----------------------------------------------------------------------
  def name
    case @result_type
      when 0
        name = $data_items[@result].name
      when 1
        name = $data_armors[@result].name
      when 2
        name = $data_weapons[@result].name
    end
    return name
  end
  def get_item
    if @result_type==2
      return $data_weapons[@result]
    end
    return nil
  end
 
 #----------------------------------------------------------------------
  def have
    have_all = true
    for i in 0...@ingredients.size
      case @ingredient_types[i]
        when 0
          if $game_party.item_number(@ingredients[i]) < @quantities[i]
            have_all=false
          end
        when 1
          if $game_party.armor_number(@ingredients[i]) < @quantities[i]
            have_all=false
          end
        when 2
          a= $game_party.weapon_number(@ingredients[i])
          a = [a-1,0].max if $game_variables[181][@ingredients[i]]!=nil && $game_variables[181][@ingredients[i]]>0\
          && !$game_actors[$game_variables[1]+1].equip_id.include?(@ingredients[i]) && @ingredients[i]!=74
          if a < @quantities[i]
            have_all=false
          end
      end
    end
    return have_all
  end

 #----------------------------------------------------------------------
  def decrement
    for i in 0...@ingredients.size
      case @ingredient_types[i]
      when 0
        $game_party.lose_item(@ingredients[i], @quantities[i])
      when 1
        $game_party.lose_armor(@ingredients[i], @quantities[i])
      when 2
        $game_party.lose_weapon(@ingredients[i], @quantities[i])
      end
    end
  end

 #----------------------------------------------------------------------
  def make
    if have
      case @result_type
      when 0
        $game_party.gain_item(@result, 1)
      when 1
        $game_party.gain_armor(@result, 1)
      when 2
        $game_party.gain_weapon(@result, 1)
        a=$data_weapons[@result]
        if a.description[0,6]=="充能" && a.description.size>6
          $game_variables[181][a.id]=a.description[6,a.description.size-6].to_i
        end
        
        def equipup(a,b)
          if $game_variables[174]!=0
            if $game_variables[174][$game_variables[1]]!=nil
              for i in 0...10
                if $game_variables[174][$game_variables[1]][i]!=nil
                  for j in 0...6
                    if $game_variables[174][$game_variables[1]][i][j]==b
                      $game_variables[174][$game_variables[1]][i][j]=a
                    end
                  end
                end
              end
            end
          end
        end
        
        case a.id
        when 50
          equipup(a.id,29)
          for i in $game_variables[182]
            for j in 0...i.size
              i[j]=56 if i[j]==39
            end
          end
        when 51
          equipup(a.id,25)
        when 66
          equipup(a.id,61)
        when 76
          equipup(a.id,53)
          for i in $game_variables[182]
            for j in 0...i.size
              i[j]=121 if i[j]==57
            end
          end
        when 82
          equipup(a.id,50)
        when 86
          equipup(a.id,42)
        when 89
          equipup(a.id,64)
        when 79
          get_achievement(17) #传奇装备
        when 126
          equipup(a.id,66)
          $game_variables[231]=126
        when 122
          equipup(a.id,121)
        when 131
          equipup(a.id,123)
          for i in $game_variables[182]
            for j in 0...i.size
              i[j]=170 if i[j]==163
            end
          end
        end
      end
      decrement
    end
  end
  
 #----------------------------------------------------------------------
  def == (recipe)
    if recipe.is_a?(Game_Recipe)
      equal = true
      if recipe.ingredients != self.ingredients
        equal = false
      end
      if recipe.ingredient_types != self.ingredient_types
        equal = false
      end
      if recipe.quantities != self.quantities
        equal = false
      end
      if recipe.result != self.result
        equal=false
      end
      if recipe.result_type != self.result_type
        equal = false
      end
    else
      equal = false
    end
    return equal
  end
  
end # of Game_Recipe class

#===================================

class Window_Craft < Window_Selectable

  #--------------------------------------------------------------------------
  def initialize(list=[])
    super(0, 0, 240, 480)
    
    @spr=Sprite.new
    @spr.x=self.x
    @spr.y=self.y
    @spr.bitmap=Bitmap.new(self.width*2,self.height*2)
    @spr.z=100
    @spr.zoom_x=0.5
    @spr.zoom_y=0.5
    
    @column_max = 1
    @list=list
    refresh
    self.index = 0
  end
  def dispose
    super
    @spr.bitmap.dispose
    @spr.dispose
  end

  #--------------------------------------------------------------------------
  def recipe
    return @data[self.index]
  end
  def item
    return @data[self.index].get_item
  end
  #--------------------------------------------------------------------------
  def refresh
    if self.contents != nil
      self.contents.dispose
      self.contents = nil
    end
    @data = []
    for i in 0...@list.size#$game_party.recipes.size
      @data.push($game_temp.recipe_list[@list[i]])#($game_party.recipes[i])
    end
    @item_max = @data.size
    if @item_max > 0
      self.contents = Bitmap.new(width - 32, row_max * 32)
   #   self.contents.font.name = "黑体" # = "黑体"
      self.contents.font.size = 18 # = 18
      for i in 0...@item_max
        draw_item(i)
      end
    end
  end

  #--------------------------------------------------------------------------
  def draw_item(index)
    recipe = @data[index]
    self.contents.font.color = recipe.have ? normal_color : disabled_color
    x = 16
    y = index * 32
    bitmap = RPG::Cache.icon(recipe.get_item.icon_name)
    @spr.bitmap.blt(x*2,y*2+32,bitmap, Rect.new(0, 0, 86, 64))
    self.contents.draw_text(x+36 , y, self.width-32, 32, recipe.name.split(":")[0], 0)
    str=recipe.get_item.description
    if str[0,6]=="充能" && str.size>6
      str=str[6,str.size-6]
      self.contents.font.size = 15 
      self.contents.font.color = text_color(12)
      self.contents.draw_text(x-7, y+9+1, 32, 32, str,2)
      self.contents.draw_text(x-7, y+9-1, 32, 32, str,2)
      self.contents.draw_text(x-7+1, y+9, 32, 32, str,2)
      self.contents.draw_text(x-7-1, y+9, 32, 32, str,2)
      self.contents.font.color = normal_color
      self.contents.draw_text(x-7, y+9, 32, 32, str,2)
      self.contents.font.size = 18 
    end
  end

  #--------------------------------------------------------------------------
  def update_help
    current_recipe = recipe
    if current_recipe.is_a?(Game_Recipe)
    case current_recipe.result_type
      when 0
        description = $data_items[current_recipe.result].description
      when 1
        description = $data_armors[current_recipe.result].description
      when 2
        description = $data_weapons[current_recipe.result].description
      end
    else
      description = ""
    end
    @help_window.set_text(description)
    @help_window.update
  end
  
end # of Window_Craft

#=======================================
class Window_CraftResult < Window_Base

  #--------------------------------------------------------------------------
  def initialize
    super(0, 0, 240, 480)
    self.contents = Bitmap.new(width - 32, height - 32)
  #  self.contents.font.name = "黑体" # = $fontface.is_a?(String) ? $fontface : $defaultfonttype
    self.contents.font.size = 18 # = 20
    @result = nil
    @type = nil
  end

  #--------------------------------------------------------------------------
  def refresh
    self.contents.clear
    case @type
      when 0
        item = $data_items[@result]
        if item.recover_hp_rate > item.recover_hp
         hp_string = "HP回复率:"
          hp_stat = item.recover_hp_rate
        else
          hp_string = "HP回复量:"
          hp_stat = item.recover_hp
        end
   if item.recover_sp_rate > item.recover_sp
          sp_string = "SP回复率:"
         sp_stat = item.recover_sp_rate
        else
         sp_string = "SP回复量:"
          sp_stat = item.recover_sp
        end
       @strings = hp_string, sp_string, "物理防御:" , "魔法防御:", "命中率:", "分散度:"#hp_string, sp_string, "物理防御:" , "魔法防御:", "命中率:", "分散度:"]
        @stats = hp_stat, sp_stat, item. pdef_f, item.mdef_f, item.hit, item.variance#hp_stat, sp_stat, item. pdef_f, item.mdef_f, item.hit, item.variance,
                       #$game_party.item_number(@result)]
        @bitmap = RPG::Cache.icon(item.icon_name)
      when 1
        item = $data_armors[@result]
        @strings = ["物理防御:", "魔法防御:", "回避修正:", "力量增加:", "灵巧增加:", 
                       "速度增加:", "魔力增加:"]
        @stats = [item.pdef, item.mdef, item.eva, item.str_plus, item.dex_plus,
                    item.agi_plus, item.int_plus, $game_party.armor_number(@result) ]
        @bitmap = RPG::Cache.icon(item.icon_name)
      when 2
        item = $data_weapons[@result]
        @strings =["攻击力:", "物理防御:", "魔法防御:", "力量增加:", "灵巧增加:",
                    "速度增加:", "魔力增加:"]
        @stats = [item.atk, item.pdef, item.mdef, item.str_plus, item.dex_plus,
                    item.agi_plus, item.int_plus, $game_party.weapon_number(@result) ]
        @bitmap = RPG::Cache.icon(item.icon_name)
    end
    for i in 0...@strings.size
      x = i%2 * 184
      y = i /2 *28 +32
      self.contents.font.color = normal_color
      self.contents.draw_text(x,y,100, 28,@strings[i])
      self.contents.font.color = system_color
      self.contents.draw_text(x + 110, y, 45, 28, @stats[i].to_s)
    end
    self.contents.blt(0, 0, @bitmap, Rect.new(0, 0, 24, 24), 255)
    self.contents.font.color= normal_color
    self.contents.draw_text(40, 0, 300, 28, "现有该物品数")
    self.contents.font.color = system_color
    count = @stats[@stats.size - 1].to_s
    self.contents.draw_text(294, 0, 45, 28, count )
  end
    
 #----------------------------------------------------------------------
  def set_result(result , type)
    @result = result
    @type = type
    refresh
  end

end #of Window_CraftResult

#=======================================
class Window_CraftIngredients < Window_Base

  #--------------------------------------------------------------------------
  def initialize
    super(240, 0, 336, 240)
    self.contents = Bitmap.new(width - 32, height - 32)
    #self.contents.font.name = "黑体" # = $fontface.is_a?(String) ? $fontface : $defaultfonttype
    self.contents.font.size = 18 # = 20
    @ingredients = []
    @types = []
    @quantities = []
    @item = nil
    @count = 0
    
    @spr=Sprite.new
    @spr.x=self.x
    @spr.y=self.y
    @spr.bitmap=Bitmap.new(self.width*2,self.height*2)
    @spr.z=100
    @spr.zoom_x=0.5
    @spr.zoom_y=0.5
  end
  def dispose
    super
    @spr.bitmap.dispose
    @spr.dispose
  end
  #--------------------------------------------------------------------------
  def refresh
    @spr.bitmap.clear
    self.contents.clear
    y=0
    self.contents.draw_text(50, y, 85, 28, "物品名称")
    self.contents.draw_text(206, y, 185, 28, "现有  需要")
    for i in 0...@ingredients.size
      case @types[i]
      when 0
        @item = $data_items[@ingredients[i]]
        @count = $game_party.item_number(@ingredients[i])
      when 1
        @item = $data_armors[@ingredients[i]]
        @count = $game_party.armor_number(@ingredients[i])
      when 2
        @item = $data_weapons[@ingredients[i]]
        @count = $game_party.weapon_number(@ingredients[i])
        @count = [@count-1,0].max if $game_variables[181][@ingredients[i]]!=nil && $game_variables[181][@ingredients[i]]>0\
          && !$game_actors[$game_variables[1]+1].equip_id.include?(@ingredients[i])  && @ingredients[i]!=74
      end
      y +=32
      bitmap = RPG::Cache.icon(@item.icon_name)
      @spr.bitmap.blt(30,y*2+26,bitmap, Rect.new(0, 0, 86, 64))
      self.contents.font.color = @count >= @quantities[i] ? normal_color : disabled_color
      self.contents.draw_text(50, y, 280, 28, @item.name.split(":")[0])
      self.contents.draw_text(272, y, 45, 28, @quantities[i].to_s)
      self.contents.font.color = system_color
      self.contents.draw_text(222, y, 45, 28, @count.to_s )     
    end
  end
      
  #--------------------------------------------------------------------------
  def set_ingredients(ingredients , types, quantities)
    @ingredients = ingredients
    @types = types
    @quantities = quantities
    refresh
  end

end # of Window_CraftIngredients

#======================================
class Scene_Craft

  #--------------------------------------------------------------------------
  def initialize(list=[],craft_index=0)
    @list=list
    @craft_index=craft_index
  end
  
  #--------------------------------------------------------------------------
  def main
    @craft_window = Window_Craft.new(@list)
    @craft_window.index=@craft_index
    @confirm_window = Window_Base.new(120, 188, 400, 64)
    @confirm_window.contents = Bitmap.new(368, 32)
  #  @confirm_window.contents.font.name = "黑体"
    @confirm_window.contents.font.size = 20
    @actor_index=0
    @actor = $game_party.actors[@actor_index]
    @result_window = Window_EquipLeft.new(@actor,@actor_index)
    @item_window = Window_EquipHelp.new
    @ingredients_window=Window_CraftIngredients.new
    @yes_no_window = Window_Command.new(100, ["确定", "放弃"])
    @confirm_window.visible = false
    @confirm_window.z = 1500
    @yes_no_window.visible = false
    @yes_no_window.active = false
    @yes_no_window.index = 1
    @yes_no_window.x = 270
    @yes_no_window.y = 252
    @yes_no_window.z = 1500
    Graphics.transition
    loop do
      Graphics.update
      Input.update
      update
      if $scene != self
        break
      end
    end
    Graphics.freeze
    @craft_window.dispose
    @result_window.dispose
    @ingredients_window.dispose
    @confirm_window.dispose
    @yes_no_window.dispose
    @item_window.dispose
  end

  #--------------------------------------------------------------------------
  def update
    @craft_window.update
    @ingredients_window.update
    if @list.size > 0
    #  @result_window.set_result(@craft_window.recipe.result, @craft_window.recipe.result_type)
      @ingredients_window.set_ingredients(@craft_window.recipe.ingredients,
                                                           @craft_window.recipe.ingredient_types,
                                                           @craft_window.recipe.quantities)
    end
             
    if @save_index !=@craft_window.index
      @save_index=@craft_window.index
      @item_window.set_text(@craft_window.item == nil ? "" : @craft_window.item.id)
    end
    if @list.size > 0
      # 获取现在选中的物品
      item2 = @craft_window.item
      if item2 !=nil
        # 变更装备
        item1 = $data_weapons[@actor.equip_id[0]]
        last_hp = @actor.hp
        last_sp = @actor.sp
        $game_party.gain_weapon(item2.id, 1)
        @actor.equip(0, item2 == nil ? 0 : item2.id)
        # 获取变更装备后的能力值
        new_atk = @actor.str
        new_pdef = @actor.dex
        new_mdef = @actor.int
        new_maxhp = @actor.maxhp
        new_maxsp = @actor.maxsp
        new_power1 = @actor.power1
        new_power2 = @actor.power2
        new_power3 = @actor.power3
        new_hpre = @actor.hprecover
        new_mp = @actor.sprecover
        new_atkspe = @actor.atkspeed
        new_shield = @actor.shield
        new_magicdef = @actor.magicdef
        new_miss = @actor.miss
        # 返回到装备
        @actor.equip(0, item1 == nil ? 0 : item1.id)
        $game_party.gain_weapon(item2.id, -1)
        @actor.hp = last_hp
        @actor.sp = last_sp
        # 描画左窗口
        @result_window.set_new_parameters(new_atk, new_pdef, new_mdef,new_maxhp,new_maxsp, \
        new_power1,new_power2,new_power3,new_hpre,new_mp,new_atkspe,new_shield,new_magicdef,new_miss)
      end
    end

    if @craft_window.active
      update_craft
      return
    end
    if @yes_no_window.active
      confirm_update
      return
    end
  end

  #--------------------------------------------------------------------------
  def update_craft
    if Input.trigger?(Input::B)
      $game_system.se_play($data_system.cancel_se)
      $scene = Scene_Map.new
      return
    end
    if Input.trigger?(Input::C) and @list.size != 0
      @recipe = @craft_window.recipe
      if @recipe.have
        @yes_no_window.active = true
        @craft_window.active = false
      else
        $game_system.se_play($data_system.buzzer_se)
        return
      end
    end
  end

  #--------------------------------------------------------------------------
  def confirm_update
    @craft_index = @craft_window.index
    @confirm_window.visible = true
    @confirm_window.z = 1500
    @yes_no_window.visible = true
    @yes_no_window.active = true
    @yes_no_window.z = 1500
    @yes_no_window.update
    string = "确定要合成 " + @recipe.name.split(":")[0] + " 吗？"
    cw = @confirm_window.contents.text_size(string).width
    center = @confirm_window.contents.width/2 - cw /2
    unless @drawn
      @confirm_window.contents.draw_text(center, 0, cw, 30, string)
      @drawn = true
    end
    if Input.trigger?(Input::C)
      if @yes_no_window.index == 0
        $game_system.se_play($data_system.decision_se)
        @recipe.make
        $game_system.se_play($data_system.save_se)
        $scene=Scene_Craft.new(@list,@craft_index)
      else
        $game_system.se_play($data_system.cancel_se)
        $scene=Scene_Craft.new(@list,@craft_index)
      end
    end
    if Input.trigger?(Input::B)
      $game_system.se_play($data_system.cancel_se)
      $scene=Scene_Craft.new(@list,@craft_index)
    end
  end

end # of Scene_Craft

#==============================================================================
# 本脚本来自www.66RPG.com，使用和转载请保留此信息
#==============================================================================
